# Pandas Day 1

## Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## How to get Pandas Version

In [2]:
# Print only the version of pandas
print(pd.__version__)
print("-------------------------")
# Print the versions of all dependencies
pd.show_versions()

2.2.3
-------------------------

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.13.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : Intel64 Family 6 Model 69 Stepping 1, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.2.3
numpy                 : 2.1.3
pytz                  : 2024.2
dateutil              : 2.9.0.post0
pip                   : 24.2
Cython                : None
sphinx                : None
IPython               : 8.29.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.5
lxml.etree            : None
matplotlib            : 3.9.2
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.15.2
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : 2.0.1
xlsxwriter            : None
zstandard             : None
tzdata                : 2024.2
qtpy                  : None
pyqt5                 : None

# How to make dataframe

In [3]:
data = {
    "Asad":["Range Rover Sportage","Lamborghini Urus","Rolls Royce Cullinan"],
    "Adnan":["Honda Civic","Honda Accord","Honda Civic"],
    "Aly":["Toyota Corolla","Toyota Camry","Toyota Corolla"],
}
# Create a DataFrame from the dictionary
df = pd.DataFrame(data)
# Display the first few rows of the DataFrame
df.head()

                   Asad         Adnan             Aly
0  Range Rover Sportage   Honda Civic  Toyota Corolla
1      Lamborghini Urus  Honda Accord    Toyota Camry
2  Rolls Royce Cullinan   Honda Civic  Toyota Corolla

In [4]:
# Create a DataFrame using numpy library
data2 = {
    "Name": np.array(["Asad", "Adnan", "Aly"]),
    "Car": np.array(["Range Rover Sportage", "Honda Civic", "Toyota Corolla"]),
    "Price": np.array([100000, 20000, 30000])
}
df2 = pd.DataFrame(data2)
print(df2)
print("-------------------------")
# Create a DataFrame with random numbers)
df3 = pd.DataFrame(np.random.rand(5,5), columns=list("ABCDE"))
print(df3)

    Name                   Car   Price
0   Asad  Range Rover Sportage  100000
1  Adnan           Honda Civic   20000
2    Aly        Toyota Corolla   30000
-------------------------
          A         B         C         D         E
0  0.316502  0.429864  0.406932  0.267567  0.509875
1  0.562245  0.758951  0.042690  0.440461  0.353075
2  0.843759  0.063919  0.299827  0.755138  0.744284
3  0.692448  0.456250  0.890466  0.262938  0.657831
4  0.108102  0.768896  0.137682  0.663341  0.685945

## How to Rename Columns

In [5]:
# Let's again have a look on a dataset
df.head()

                   Asad         Adnan             Aly
0  Range Rover Sportage   Honda Civic  Toyota Corolla
1      Lamborghini Urus  Honda Accord    Toyota Camry
2  Rolls Royce Cullinan   Honda Civic  Toyota Corolla

In [6]:
# Current name of columns
print(df.columns)
print("----------------")
# Rename the columns of the DataFrame
df.rename(columns={"Asad":"Asad_Dream_Cars","Adnan":"Adnan_Dream_Cars","Aly":"Aly_Dream_Cars"}, inplace=True)
print(df.head())
# Let's recheck the columns names
print(df.columns)

Index(['Asad', 'Adnan', 'Aly'], dtype='object')
----------------
        Asad_Dream_Cars Adnan_Dream_Cars  Aly_Dream_Cars
0  Range Rover Sportage      Honda Civic  Toyota Corolla
1      Lamborghini Urus     Honda Accord    Toyota Camry
2  Rolls Royce Cullinan      Honda Civic  Toyota Corolla
Index(['Asad_Dream_Cars', 'Adnan_Dream_Cars', 'Aly_Dream_Cars'], dtype='object')

# How to use Template Data

In [14]:
# Setting to display all rows
pd.set_option('display.max_rows', None)

In [15]:
# Load a Titanic dataset using seaborn
boat = sns.load_dataset('titanic')
# Let's have a look on the top 5 rows of titanic dataset
print("Titanic Dataset")
print(boat.head(5))
print("---------------------------")
# Again load the Iris dataset using seaborn
print("Iris Dataset")
flower = sns.load_dataset("iris")
# Let's have a look on the last 5 rows of Iris Dataset
print(flower.tail(5))
print("-------------------------")
# Let's get the statistical summary of the Iris Dataset
print(flower.describe())
print("-------------------------")
# Let's get the name of columns of the Iris dataset
print(flower.columns)
print("-------------------------")
# Let's save the Iris dataset to a CSV file
flower.to_csv("Iris.csv")
# Let's save the Iris dataset to an Excel file
flower.to_excel("Iris.xlsx")
# Let's read the Iris dataset from a CSV file
flower = pd.read_csv("Iris.csv")

Titanic Dataset
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
---------------------------
Iris Dataset
     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica
-------------------------
       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000
-------------------------
Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')
-------------------------

# Reverse Row Order

In [17]:
df = sns.load_dataset("titanic")
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [21]:
# Row reverse order
df = df.loc[::-1]
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [24]:
# Reset index of rows in to its original order
df = df.loc[::-1].reset_index(drop=True)
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [29]:
# Let's reverse the order of columns
df = sns.load_dataset("titanic")  # Ensure df is a DataFrame
df = df[df.columns[::-1]]
print(df.head())

   alone alive  embark_town deck  adult_male    who  class embarked     fare  \
0  False    no  Southampton  NaN        True    man  Third        S   7.2500
1  False   yes    Cherbourg    C       False  woman  First        C  71.2833
2   True   yes  Southampton  NaN       False  woman  Third        S   7.9250
3  False   yes  Southampton    C       False  woman  First        S  53.1000
4   True    no  Southampton  NaN        True    man  Third        S   8.0500

   parch  sibsp   age     sex  pclass  survived
0      0      1  22.0    male       3         0
1      0      1  38.0  female       1         1
2      0      0  26.0  female       3         1
3      0      1  35.0  female       1         1
4      0      0  35.0    male       3         0

# Select columns from dataset on the base of datatype

In [33]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
# Selecting specific columns that is numeric
df = df.select_dtypes(include=["number"])
df.columns

Index(['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

In [35]:
# Selecting specific columns that is object
df = sns.load_dataset("titanic")  # Ensure df is a DataFrame
df = df.select_dtypes(include=["object"])
df.columns

Index(['sex', 'embarked', 'who', 'embark_town', 'alive'], dtype='object')

In [38]:
# Selecting specific columns that are neither a number nor an object
df = sns.load_dataset("titanic")  # Ensure df is a DataFrame
df = df.select_dtypes(exclude=["number","object"])
df.columns

Index(['class', 'adult_male', 'deck', 'alone'], dtype='object')

In [40]:
# Selecting specific columns that is boolean
df = sns.load_dataset("titanic")
df = df.select_dtypes(include=["bool"])
df.columns

Index(['adult_male', 'alone'], dtype='object')